{
    "pageTitle": "مستودع المكدسات",
    "stack": "مكدس",
    "pushValue": "دفع قيمة",

    "stackOperations": "عمليات المكدس",
    "sort": "فرز",
    "sortAsc": "فرز تصاعدي",
    "sortDesc": "فرز تنازلي",
    "append": "إضافة",
    "move": "نقل",
    "reverse": "عكس",
    "union": "اتحاد",
    "filter": "فلترة",

    "operationPanel": "لوحة العمليات",
    "operationPlay": "بدأ",
    "operationShowSteps": "عرض الخطوات",
    "operationReset": "إعادة",

    "addFilter": "...أضف شرط",
    "andFilter": "و",
    "orFilter": "أو",

    "step-0":
    {
        "0": "إدفع",
        "1": "إلى"
    },
    "step-1":
    {
        "0": "لأن",
        "1": "أكبر من",
        "2": "إدفع",
        "3": "إلى"
    },
    "step-2":
    {
        "0": "لأن",
        "1": "أقل من",
        "2": "إدفع",
        "3": "إلى"
    },
    "step-3":
    {
        "0": "لأن",
        "1": "يساوي",
        "2": "إدفع",
        "3": "إلى"
    },
    "step-4":
    {
        "0": "لأن",
        "1": "يجتاز الفلتر, إدفع",
        "2": "إلى"
    },
    "step-5":
    {
        "0": "لأن",
        "1": "لا يجتاز الفلتر, أعد",
        "2": "إلى"
    },
    "step-done": "تم",

    "stackNames":
    {
        "stack": "مكدس",
        "input": "مدخلات",
        "output": "ناتج",
        "temp": "مؤقت",
        "temp2": "مؤقت 2",
        "second": "ثاني",
        "third": "ثالث",
        "variable": "متغير"
    },

    "info":
    {
        "s1": "ما هو؟",
        "s1-1": "تطبيق ويب بسيط لتوفير نموذج لنوع البيانات المعروف باسم \"المكدس\" بالإضافة إلى بعض العمليات التي يمكن القيام بها على المكدس.",
        "s1-2": "في المكدس، يكون التركيز الرئيسي على العنصر العلوي حيث لا يمكن الوصول إلى العناصر الموجودة تحته ما لم تتم إزالة العنصر العلوي. يُشار إلى طريقة عمل المكدس باسم FILO (أول ما يدخل يخرج أخيرًا) أو LIFO (اخر ما يدخل يخرج أولا) حيث سيتم دفن العنصر الأول الذي تمت إضافته إلى المكدس في الأسفل و يكون آخر عنصر يتم إزالته.",
        "s1-3": "في هذا التطبيق ، تشير عربة المستودع إلى مكدس ، وتشير الصناديق إلى عناصر المكدس. (العربة التي تحمل الصناديق هي تطبيق حقيقي للمكدس حيث يمكن إزالة الصندوق العلوي فقط في كل مرة.)",

        "s2": "كيفية الإستعمال:",
        "s2-1": "الدفع:",
        "s2-2": "يعني الدفع إضافة عنصر فوق المكدس. لدفع عنصر إلى المكدس، ما عليك سوى إدخال قيمة عددية في حقل الإدخال ثم النقر فوق زر الضغط أو ببساطة الضغط على مفتاح Enter.",
        "s2-3": "السحب:",
        "s2-4": "يعني السحب إزالة العنصر الموجود أعلى المكدس. لإخراج عنصر من المكدس، ما عليك سوى نقر زر السحب.",
        "s2-5": "صناديق النقل عن طريق السحب والإفلات:",
        "s2-6": "في الكود ، يتم نقل القيمة بين المكدس عن طريق دفع القيمة الأعلى للمكدس الأول إلى للمكدس الثاني ثم سحبها من المكدس الأول. في هذا التطبيق ، تتمثل إحدى الطرق البسيطة سهلة الاستخدام لنقل عنصر بسحبه وإفلاته في مكدس آخر. لاحظ أنه يمكن سحب العنصر العلوي فقط.",
        "s2-7": "تغيير حجم المكدس:",
        "s2-8": "للتحكم في عدد العناصر التي يمكن للمكدس الاحتفاظ بها ، استخدم ملصق الحجم الموجود على يسار المكدس واسحب لأعلى أو لأسفل لتغيير حجمه. لاحظ أنه من أجل بساطة التمثيل الرسومي ، يمكن لكل مكدس استيعاب ما يصل إلى عشرة عناصر فقط.",
        "s2-9": "إضافة وإزالة المكدس:",
        "s2-10": "انقر فوق الزر \"إضافة\" لإنشاء مكدس جديد أو انقر فوق الزر \"إزالة\" الموجود أسفل المكدس لإزالته. يمكن أن يكون لديك ما يصل إلى خمسة مكدسات.",
        "s2-11": "تسميات المكدس:",
        "s2-12": "يمكن أن تساعدك تسمية كل مكدس على تذكر الغرض من كل مكدس أثناء إجراء العمليات وتجربة طرق جديدة. لتحرير تسمية المكدس، ما عليك سوى النقر فوق التسمية وتعديل النص.",

        "s3": "عمليات المكدس:",
        "s3-1": "بالضغط على زر التشغيل أسفل المكدس غير الفارغ ، ستجد العديد من العمليات التي يمكن إجراؤها باستخدام المكدس التي حددته. فيما يلي عمليات المكدس الشائعة:",
        "s3-2": "الفرز: فرز المكدس رقميًا (تصاعديًا أو تنازليًا)",
        "s3-3": "إلحاق: ضم عناصر مكدس آخر إلى مكدس موجود مع الاحتفاظ بالترتيب",
        "s3-4": "نقل: نقل عناصر المكدس إلى مكدس أخر مع الاحتفاظ بالترتيب",
        "s3-5": "عكس: عكس المكدس",
        "s3-6": "الاتحاد: إرجاع العناصر المشتركة بين مكدستين",
        "s3-7": "الفلترة: تصفية العناصر حسب الشروط المخصصة",

        "s3-8": "نافذة العمليات:",
        "s3-9": "من خلال تحديد عملية ما ، سيتم فتح نافذة جديدة حيث سيتم استخدام مكدسات متعددة لتنفيذ العملية المطلوبة على المكدس المحدد.",
        "s3-10": "أثناء العملية ، سيتم تمييز كل مكدس بتسمية خاصة لتحديد الغرض منه. هذه المكدسات المصنفة هي:",
        "s3-11": "المدخلات: المكدس المحدد للعملية",
        "s3-12": "الناتج: المكدس المعدل الناتج عن العملية",
        "s3-13": "متغير: مكدس متغير يمكن تعديله لاختبار مدخلات مختلفة لبعض العمليات",
        "s3-14": "مؤقت: المكدسات المسمى بـ \"مؤقت\" أو تسميات أخرى تستخدم كمكدسات مؤقتة أثناء العمليات",

        "s3-15": "لوحة التحكم بالعمليات:",
        "s3-16": "تتكون اللوحة من ثلاثة أزرار للتحكم في العملية:",
        "s3-17": "بدأ: يقوم ببدأ العملية ويظهر النتائج تلقائيًا",
        "s3-18": "عرض الخطوات: تنفيذ العملية خطوة بخطوة مع وصف موجز لكل خطوة",
        "s3-19": "إعادة :يعيد المكدسات الى ما قبل العملية. يمكن النقر فوقه عند انتهاء العملية أو أثناء إظهار الخطوات",
        "s3-20": "ستظهر \"لوحة فلاتر \" إضافية مع عملية الفلترة حيث يمكنك إضافة ما يصل إلى 5 فلاتر.",
        "s3-21": "لإضافة شرط فلترة (في صيغة شروط البرمجة المعروفة) ، اكتب الشرط وانقر على زر الإضافة أو اضغط على Enter. سيتم إدخال الشروط الصالحة فقط. بالنسبة الشرط الثاني وأكثر، يمكنك اختيار إما \"و \" أو \"أو \" لجمعها مع الشروط السابقة."
    },

    "footer": "© عمر وليد دياب"

}